# IFCGenericRevitImportWarning Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ImportFailures..::..IFCGenericRevitImportWarning Property
BuiltInFailures..::..ImportFailures Class See Also
---
Revit had the following problems importing the IFC file: [Description]
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId IFCGenericRevitImportWarning { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property IFCGenericRevitImportWarning As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ IFCGenericRevitImportWarning {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ImportFailures Class
Autodesk.Revit.DB Namespace